# SM_Preferences

## Description
Shows the Structural Member Tool Preferences Dialog.

```pascal
PROCEDURE SM_Preferences;
```

```python

def vs.SM_Preferences():
    return None
```

## Version
Availability: from Vectorworks 2024
## Category
* StructuralMember